src/main/resources/manual.tex
% Created 2015-01-11 Sun 22:05
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Bedienhandbuch PnEd}
\author{Markus Rother (8544832)}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


In diesem Bedienhandbuch wird der \emph{PnEd} - ein einfacher Petri-Netz
Editor vorgestellt.  Dieser, sowie die hiermit vorliegende
Dokumentation sind als Aufgabenbearbeitung des Grundpraktikum
Programmierung (Kurs 01584) im Wintersemester 2014/15 an der
Fernuniversität in Hagen entstanden.  Der Editor wurde von mir (Markus
Rother) in Java implementiert, und mit dem Namen \emph{PnEd} versehen.

Diese Dokumentation skizziert meine wichtigsten Designentscheidungen
und wie sie entstanden sind.  Anschließend wird die Grundlegende
Architektur der Software vorgestellt, also die Strukturierung der
\verb|packages| und der wichtigsten Klassen. Die Bedienanleitung
beschreibt detailliert die Verwendung des Editors.  Abschließend wird
das größte bekannte Problem kurz beschrieben.
\pagebreak
\tableofcontents
\pagebreak

\section{Design des PnEd}
\label{sec-1}
\subsection{Loose Kopplung und Single-Responsibility-Prinzip}
\label{sec-1-1}


   Zu Beginn der Bearbeitungsphase stürzte ich mich kopfüber in die
   Implementierung eines Datenmodells. Als ich dann begann, an der
   Benutzeroberfläche zu arbeiten, stellte sich rasch heraus, dass die
   beiden nicht so recht zusammenpassen wollten. Ich musste das
   Datenmodell häufig an die Anforderungen der Benutzeroberfläche
   anpassen.  Außerdem war vieles am Datenmodell unnötig.

   Es bestand ganz offensichtlich eine sehr starke Kopplung zwischen
   meinem Datenmodell und der Benutzeroberfläche, die mir missfiel.
   Ich entschied mich, das Datenmodell vollständig zu ignorieren und
   zunächst die Oberfläche zu schreiben.  Ich wollte bei der Erstellung der
   Oberfläche so wenig Annahmen wie möglich über das zugrunde liegende
   Datenmodell machen.

   Dazu sollte die Verbindung zwischen Datenmodell und der
   Benutzeroberfläche über Ereignisse (events) stattfinden.  Ähnlich
   einer Client-Server Architektur sollte die Benutzeroberfläche mit
   dem Datenmodell mittels Nachrichten sprechen.  Ich bräuchte dann
   lediglich einen Verbindungsstrang, über den diese Nachrichten,
   Ereignisse oder Anfragen kommuniziert würden.

   Die Benutzeroberfläche selbst sollte dabei frei von jeglicher Logik
   bleiben, zum Beispiel nicht für das Berechnen des Netzes bei
   Schaltung von Transitionen verantwortlich sein. Und das Datenmodell
   sollte keinerlei Kenntnis des Zustands der Visualisierung haben,
   nicht einmal, welche Knoten gerade ausgewählt wären.

   Mit diese puristischen herangehensweise gelang es mir zu meiner
   eigenen Überraschung, die Benutzeroberfläche fast vollständig -
   sozusagen als eine Hülle - zu implementieren, ohne mich im
   geringsten um die Logik des Petri-Netzes zu kümmern.  Zu meiner
   noch größeren Überraschung war das Anschließende implementieren des
   Datenmodells eine Arbeit von kaum zwei Stunden.  Noch einfacher war
   die Anbindung des vorgegebenen PNMLParsers, da auch dieser wie die
   Benutzeroberfläche lediglich Nachrichten verschicken musste, also
   etwa für das Erstellen eines Knotens eine Nachricht mit Typ, Namen
   und Koordinaten.  Diese Nachricht würde dann sowohl vom Datenmodell
   als auch von der Benutzeroberfläche entsprechend interpretiert.

   Kritisch resümierend kann ich folgendes festellen: Auch wenn ich
   mir im Verlauf des Projekts durch mein Vorgehen zahlreiche andere
   Probleme einhandelte, halte ich meine Entscheidung für gut. Ich
   habe erfahren, wo die Grenzen einer solchen Trennung liegen, ich
   konnte mich mit Nebenläufigkeit- und musste mich mit einigen
   Details des \verb|swing| frameworks befassen. Es wäre sicherlich
   vieles einfacher gewesen, aber bei weitem nicht so erkenntnisreich.
\subsection{Aufbau der Pakete}
\label{sec-1-2}


   Das Projekt ist in 23 Pakete unterteilt.  Diese können weiter in
   drei größere Bereiche gruppiert werden:

\begin{enumerate}
\item Pakete, deren Klassen die Kernfunktionalität des \emph{PnEd}
      auszeichnen. Ohne diese Klassen funktioniert nichts, sie
      funktionieren aber ohne andere Klassen des Editors.
\item Pakete, deren Klassen die Funktionalität der Benutzeroberfläche
      bereitstellen.  Sie stehen ebenfalls weitestgehend für sich,
      haben also kaum Abhängigkeiten zur ersten Gruppe.
\item Pakete, deren Klassen Hilfsfunktionalität bereitstellen. Auch
      diese sind frei von Abhängigkeiten zu den oberen beiden.
\end{enumerate}

   Im Anschluß werden die wichtigsten Pakete
   aus 1. und 2. vorgestellt.
\subsubsection{.pned.core.model}
\label{sec-1-2-1}

      In diesm Paket befinden sich die Schnittstellenklassen des
      Datenmodells. Es handelt sich hierbei um das von der
      Logik-Schicht verwendete Datenmodell, welches nicht von der
      Benutzeroberfläche benötigt wird. Das Paket beinhaltet keine
      Implementierungen.
\subsubsection{.pned.core}
\label{sec-1-2-2}

     In diesm Paket befinden sich je eine mögliche Implementierungen
     der Schnittstellenklassen aus \verb|.pned.core.model|. Außerdem
     liegen hier die Ausnahmen (\verb|exceptions|), die in Klassen
     dieses Pakets auftreten können.
\subsubsection{.pned.gui.core.model}
\label{sec-1-2-3}

    Analog zu \verb|.pned.core.model| befinden sich in diesem Paket
    diejenigen Schnittstellentypen, die für die Visualisierung
    notwendig sind, also etwa das zustandsabhängige Aussehen der
    Knoten und Kanten.
\subsubsection{.pned.gui.core}
\label{sec-1-2-4}

    Hier befinden sich Implementierungen der Schnittstellen aus
    \verb|.pned.gui.core.model|.
\subsubsection{.pned.gui.components}
\label{sec-1-2-5}

    In diesem Paket und seinen Unterpaketen sind die eigentlichen
    Komponentenklassen abgelegt, also vor allem Erweiterungen von
    \verb|javax.swing| Objekten für Knoten, Kanten und andere
    Elemente, außerdem das Hauptfenster, Dialogfenster, Menus, sowie
    Listener-Klassen welche den Arbeitsfluß der Benutzeroberfläche
    steuern.  So gibt es zum Beispiel unter
    \verb|.pned.gui.components.listeners| ein Listener-Objekt, welches
    für die Auswahl von Knoten zuständig ist.
