src/main/resources/manual.org
*** .pned.control und .pned.gui.control
    In diesen beiden Paketen und ihren Unterpaketen befinden sich die
    Klassen die für die eingangs geschilderte Art der Kommunikation
    durch Nachrichten zuständig sind.  Diese Pakete bilden sozusagen
    das Herz des /PnEd/.  Hier liegen jeweils drei Unterpakete für
    Ereignis- oder Nachrichtenarten:
    
    + .commands :: Hier liegen Nachrichten-Klassen, welche
                   Veränderungen anstoßen, sozusagen /befehlen/
                   sollen. In der Regel werden diese durch
                   Nutzeraktionen angestoßen.
    + .events :: Hier liegen Nachrichten-Klassen, welche Ereignisse
                 ausdrücken sollen, die nicht /befohlen/ wurden,
                 sondern vielmehr aufgrund vorangegangener /Befehle/
                 enstanden sind, also aufgrund der Funktionsweise von
                 Petri-Netz und Oberfläche ausgelöst wurden.
    + .requests :: Hier liegen Nachrichten-Klassen, welche Antworten
                   erwarten. Derzeit gibt es nur zwei Nachrichten für
                   die das zutrifft: 1. Die Anfrage nach einem Namen
                   für ein neues Element, und 2. Die Anfrage nach
                   einem Element für einen Namen. Letztere wird
                   lediglich von der Oberflächenschicht benötigt.

    In diesen Paketen liegen außerdem jeweils Listener-Klassen für die
    beschriebenen Ereignisse. Und schließlich liegen in den Paketen
    \verb|.pned.control| und \verb|.pned.gui.control| die Klassen
    \verb|EventBus| und \verb|PnEventBus| - dem eigentlichen
    Nachrichtenkanal.

    Wie eingangs beschrieben, findet der Nachrichtenaustausch über den
    \verb|EventBus| statt.  Gültige Eingaben und Ereignisse die eine
    Veränderung beschreiben werden als ein Ereignis
    instanziert. dieses wird dann vom Aufrufer, z.B. einem Listener,
    an den \verb|EventBus| weitergereicht. Dieser implementiert selbst
    die entsprechende Schnittstelle. Seine Aufgabe besteht nun
    lediglich darin, das Ereignis an die bei ihm registrierten
    Listener zu verteilen. Man könnte auch von einem Multiplexer
    sprechen.
    
    Eine Konsistenzprüfung erfolgt in der Regel nicht. Es wird also
    nicht festgestellt, ob Ereignisse in einer bestimmten Reihenfolge
    bedient werden können.  Auch eine Fehlerbehandlung wird nicht
    zurückgereicht.  Das verwendete Protokoll ist sozusagen
    /verbindungslos/. Das birgt natürlich potentielle Probleme, war
    aber eine bewußte Entscheidung zugunsten looser Kopplung.  Die
    Darstellung ist letztlich nicht für die Konsistenz des
    Datenmodells verantwortlich und umgekehrt!

*** Weiter Pakete
    
    Es folgt lediglich eine Kurzbeschreibung der restlichen Pakete.

    + .concurrent :: Hilfsklassen für die Behandlung von Nebenläufigkeit.

    + .pned.gui.actions :: Unterklassen von
         \verb|javax.swing.AbstractAction|, welche Nutzereingaben
         abstrahieren.

    + .pned.io :: Klassen, die für die Ein-, Ausgabe von Petri-Netzen
                  zuständig sind. Hierzu gehört der vorgegebene
                  \verb|PNMLParser| sowie Klassen zur Serialisierung
                  des Petri-Netz Modells.

    + .pned.util :: Hier liegen Hilfsklassen, die für den Betrieb des
                    /PnEd/ nicht nötig sind, aber während der
                    Entwicklung hilfreich waren, z.B. ein Logger.

    + .swing :: Eine Ansammlung von eigenständigen Erweiterungen des
                \verb|swing| frameworks. Hier liegt z.B. ein
                selbst-validierendes Eingabefeld, wie es im Editor
                verwendet wird.

    + .util :: Weitere, allgemeine Hilfsklassen.

\pagebreak
* Bedienung des /PnEd/

** Verwaltung der Dateien

*** Erstellen eines neuen Petri-Netzes
    Um ein neues Petri-Netz zu erstellen, wählen Sie in der Menüleiste
    \Rightarrow *File* \Rightarrow *New*.  Diese Aktion verwirft das
    derzeit editierte Netz unwiderruflich und ohne Nachfrage.

*** Import/Öffnen
    Zum Öffnen einer bereits vorhandenen Datei wählen Sie in der
    Menüleiste \Rightarrow *File* \Rightarrow *Import*. Wählen Sie die
    zu öffnende Datei aus Ihrem Dokumentenordner und bestätigen Sie
    über den *Open* Druckknopf.  Die voreingestellte Dateiendung ist
    \verb|.pnml|, es lassen sich jedoch beliebig benannte Dateien
    öffnen.  Geladen werden können Dateien eines nicht näher
    spezifizierten PNML-Formats.  Kann eine Datei nicht geladen
    werden, bleibt die Aktion folgenlos.  Auch das Öffnen einer einer
    Datei verwirft das derzeit editierte Netz unwiderruflich und ohne
    Nachfrage.

*** Export/Speichern
    Erstellte Petri-Netze können Sie exportieren über Menüleiste
    \Rightarrow *File* \Rightarrow *Export*, der Anwahl des
    Speicherortes und Bestätigen über den *Save* Druckknopf. Die
    Dateien werden in einem PNML-Format abgespeichert.  Wird eine
    existierende Datei als Ziel des Speichervorgangs ausgewählt, so
    wird diese ohne weitere Nachfrage überschrieben.  Es besteht keine
    Garantie, dass das gespeicherte Format eines zuvor geladenen
    Netzes binärkompatibel ist, nicht einmal wenn dieses Netz mit dem
    /PnEd/ erstellt wurde.

** Erstellen/Löschen von Knoten und Kanten

   Innerhalb des Rasterfelds können Sie beliebig erweiterbar Knoten
   und Kanten setzen, das editierbare Feld vergrößert sich automatisch
   mit dem Setzen von Knoten bei Bedarf. Die Vergrößerung des
   Rasterfeldes geschieht ausschließlich auf diese Weise, also wenn
   neue Knoten in der Nähe des rechten oder unteren Randes gesetzt
   werden.  Über die Bildlaufleisten kann dann der Sichtbare Bereich
   verändert werden.

*** Erstellen und Platzieren von Stellen
    Zum Erstellen einer Stelle wählen Sie in der Menüleiste
    \Rightarrow *Edit* und aktivieren das Optionsfeld vor *Create
    place*, so dass das Suffix *(default)* erscheint. Alternativ
    können Sie ein Kontextmenü über einen Rechtsklick im Rasterfeld
    aufrufen und diese Einstellung dort vornehmen. Wenn Sie
    anschließend mit der linken Maustaste in das Rasterfeld klicken
    erhalten Sie automatisch eine Stelle. 

    Solange das Optionsfeld bei *Create place* gesetzt bleibt,
    generiert jeder Linksklick im Rasterfeld eine neue Stelle. Dies
    ist auch der voreingestellte Wert, so dass bei neu geöffnetem
    /PnEd/ zunächst Stellen erzeugt werden.

*** Erstellen und Platzieren von Transitionen
    Zum Erstellen einer Transition wählen Sie in der Menüleiste
    \Rightarrow *Edit* und aktivieren das Optionsfeld vor *Create
    transition*, so dass das Suffix *(default)* erscheint. Alternativ
    können Sie ein Kontextmenü über einen Rechtsklick im Rasterfeld
    aufrufen und diese Einstellung dort vornehmen. Wenn Sie
    anschließend mit der linken Maustaste in das Rasterfeld klicken
    erhalten Sie automatisch eine Transition.

    Solange das Optionsfeld bei *Create transition* gesetzt bleibt,
    generiert jeder Linksklick im Rasterfeld eine neue Transition.
    Neu erzeugte Transitionen werden grün dargestellt, wodurch ihre
    Aktivierung kenntlich ist.

*** Verschieben von Stellen und Transitionen
    Einzelne Stellen oder Transitionen können jederzeit mit dem
    Mauszeiger bei gehaltener linker Maustaste verschoben werden.

    Zum Verschieben mehrerer Knoten ziehen Sie bei gehaltener linker
    Maustaste ein Auswahlfeld über die zu verschiebenden Stellen
    bzw. Transitionen. Die Knoten sind dann durch eine rote Umrahmung
    markiert. Ziehen sie nun einen beliebigen Knoten mit dem
    Mauszeiger bei gehaltener linker Maustaste, um alle ausgewählten
    Knoten zu verschieben.

