src/main/resources/manual.tex
\subsubsection{.pned.control und .pned.gui.control}
\label{sec-1-2-6}

    In diesen beiden Paketen und ihren Unterpaketen befinden sich die
    Klassen die für die eingangs geschilderte Art der Kommunikation
    durch Nachrichten zuständig sind.  Diese Pakete bilden sozusagen
    das Herz des \emph{PnEd}.  Hier liegen jeweils drei Unterpakete für
    Ereignis- oder Nachrichtenarten:
    
\begin{description}
\item[.commands] Hier liegen Nachrichten-Klassen, welche
                   Veränderungen anstoßen, sozusagen \emph{befehlen}
                   sollen. In der Regel werden diese durch
                   Nutzeraktionen angestoßen.
\item[.events] Hier liegen Nachrichten-Klassen, welche Ereignisse
                 ausdrücken sollen, die nicht \emph{befohlen} wurden,
                 sondern vielmehr aufgrund vorangegangener \emph{Befehle}
                 enstanden sind, also aufgrund der Funktionsweise von
                 Petri-Netz und Oberfläche ausgelöst wurden.
\item[.requests] Hier liegen Nachrichten-Klassen, welche Antworten
                   erwarten. Derzeit gibt es nur zwei Nachrichten für
                   die das zutrifft: 1. Die Anfrage nach einem Namen
                   für ein neues Element, und 2. Die Anfrage nach
                   einem Element für einen Namen. Letztere wird
                   lediglich von der Oberflächenschicht benötigt.
\end{description}

    In diesen Paketen liegen außerdem jeweils Listener-Klassen für die
    beschriebenen Ereignisse. Und schließlich liegen in den Paketen
    \verb|.pned.control| und \verb|.pned.gui.control| die Klassen
    \verb|EventBus| und \verb|PnEventBus| - dem eigentlichen
    Nachrichtenkanal.

    Wie eingangs beschrieben, findet der Nachrichtenaustausch über den
    \verb|EventBus| statt.  Gültige Eingaben und Ereignisse die eine
    Veränderung beschreiben werden als ein Ereignis
    instanziert. dieses wird dann vom Aufrufer, z.B. einem Listener,
    an den \verb|EventBus| weitergereicht. Dieser implementiert selbst
    die entsprechende Schnittstelle. Seine Aufgabe besteht nun
    lediglich darin, das Ereignis an die bei ihm registrierten
    Listener zu verteilen. Man könnte auch von einem Multiplexer
    sprechen.
    
    Eine Konsistenzprüfung erfolgt in der Regel nicht. Es wird also
    nicht festgestellt, ob Ereignisse in einer bestimmten Reihenfolge
    bedient werden können.  Auch eine Fehlerbehandlung wird nicht
    zurückgereicht.  Das verwendete Protokoll ist sozusagen
    \emph{verbindungslos}. Das birgt natürlich potentielle Probleme, war
    aber eine bewußte Entscheidung zugunsten looser Kopplung.  Die
    Darstellung ist letztlich nicht für die Konsistenz des
    Datenmodells verantwortlich und umgekehrt!
\subsubsection{Weiter Pakete}
\label{sec-1-2-7}

    
    Es folgt lediglich eine Kurzbeschreibung der restlichen Pakete.

\begin{description}
\item[.concurrent] Hilfsklassen für die Behandlung von Nebenläufigkeit.
\item[.pned.gui.actions] Unterklassen von
         \verb|javax.swing.AbstractAction|, welche Nutzereingaben
         abstrahieren.
\item[.pned.io] Klassen, die für die Ein-, Ausgabe von Petri-Netzen
                  zuständig sind. Hierzu gehört der vorgegebene
                  \verb|PNMLParser| sowie Klassen zur Serialisierung
                  des Petri-Netz Modells.
\item[.pned.util] Hier liegen Hilfsklassen, die für den Betrieb des
                    \emph{PnEd} nicht nötig sind, aber während der
                    Entwicklung hilfreich waren, z.B. ein Logger.
\item[.swing] Eine Ansammlung von eigenständigen Erweiterungen des
                \verb|swing| frameworks. Hier liegt z.B. ein
                selbst-validierendes Eingabefeld, wie es im Editor
                verwendet wird.
\item[.util] Weitere, allgemeine Hilfsklassen.
\end{description}

\pagebreak
\section{Bedienung des \emph{PnEd}}
\label{sec-2}
\subsection{Verwaltung der Dateien}
\label{sec-2-1}
\subsubsection{Erstellen eines neuen Petri-Netzes}
\label{sec-2-1-1}

    Um ein neues Petri-Netz zu erstellen, wählen Sie in der Menüleiste
    $\Rightarrow$ \textbf{File} $\Rightarrow$ \textbf{New}.  Diese Aktion verwirft das
    derzeit editierte Netz unwiderruflich und ohne Nachfrage.
\subsubsection{Import/Öffnen}
\label{sec-2-1-2}

    Zum Öffnen einer bereits vorhandenen Datei wählen Sie in der
    Menüleiste $\Rightarrow$ \textbf{File} $\Rightarrow$ \textbf{Import}. Wählen Sie die
    zu öffnende Datei aus Ihrem Dokumentenordner und bestätigen Sie
    über den \textbf{Open} Druckknopf.  Die voreingestellte Dateiendung ist
    \verb|.pnml|, es lassen sich jedoch beliebig benannte Dateien
    öffnen.  Geladen werden können Dateien eines nicht näher
    spezifizierten PNML-Formats.  Kann eine Datei nicht geladen
    werden, bleibt die Aktion folgenlos.  Auch das Öffnen einer einer
    Datei verwirft das derzeit editierte Netz unwiderruflich und ohne
    Nachfrage.
\subsubsection{Export/Speichern}
\label{sec-2-1-3}

    Erstellte Petri-Netze können Sie exportieren über Menüleiste
    $\Rightarrow$ \textbf{File} $\Rightarrow$ \textbf{Export}, der Anwahl des
    Speicherortes und Bestätigen über den \textbf{Save} Druckknopf. Die
    Dateien werden in einem PNML-Format abgespeichert.  Wird eine
    existierende Datei als Ziel des Speichervorgangs ausgewählt, so
    wird diese ohne weitere Nachfrage überschrieben.  Es besteht keine
    Garantie, dass das gespeicherte Format eines zuvor geladenen
    Netzes binärkompatibel ist, nicht einmal wenn dieses Netz mit dem
    \emph{PnEd} erstellt wurde.
\subsection{Erstellen/Löschen von Knoten und Kanten}
\label{sec-2-2}


   Innerhalb des Rasterfelds können Sie beliebig erweiterbar Knoten
   und Kanten setzen, das editierbare Feld vergrößert sich automatisch
   mit dem Setzen von Knoten bei Bedarf. Die Vergrößerung des
   Rasterfeldes geschieht ausschließlich auf diese Weise, also wenn
   neue Knoten in der Nähe des rechten oder unteren Randes gesetzt
   werden.  Über die Bildlaufleisten kann dann der Sichtbare Bereich
   verändert werden.
\subsubsection{Erstellen und Platzieren von Stellen}
\label{sec-2-2-1}

    Zum Erstellen einer Stelle wählen Sie in der Menüleiste
    $\Rightarrow$ \textbf{Edit} und aktivieren das Optionsfeld vor \textbf{Create     place}, so dass das Suffix \textbf{(default)} erscheint. Alternativ
    können Sie ein Kontextmenü über einen Rechtsklick im Rasterfeld
    aufrufen und diese Einstellung dort vornehmen. Wenn Sie
    anschließend mit der linken Maustaste in das Rasterfeld klicken
    erhalten Sie automatisch eine Stelle. 

    Solange das Optionsfeld bei \textbf{Create place} gesetzt bleibt,
    generiert jeder Linksklick im Rasterfeld eine neue Stelle. Dies
    ist auch der voreingestellte Wert, so dass bei neu geöffnetem
    \emph{PnEd} zunächst Stellen erzeugt werden.
\subsubsection{Erstellen und Platzieren von Transitionen}
\label{sec-2-2-2}

    Zum Erstellen einer Transition wählen Sie in der Menüleiste
    $\Rightarrow$ \textbf{Edit} und aktivieren das Optionsfeld vor \textbf{Create     transition}, so dass das Suffix \textbf{(default)} erscheint. Alternativ
    können Sie ein Kontextmenü über einen Rechtsklick im Rasterfeld
    aufrufen und diese Einstellung dort vornehmen. Wenn Sie
    anschließend mit der linken Maustaste in das Rasterfeld klicken
    erhalten Sie automatisch eine Transition.

    Solange das Optionsfeld bei \textbf{Create transition} gesetzt bleibt,
    generiert jeder Linksklick im Rasterfeld eine neue Transition.
    Neu erzeugte Transitionen werden grün dargestellt, wodurch ihre
    Aktivierung kenntlich ist.
\subsubsection{Verschieben von Stellen und Transitionen}
\label{sec-2-2-3}

    Einzelne Stellen oder Transitionen können jederzeit mit dem
    Mauszeiger bei gehaltener linker Maustaste verschoben werden.

    Zum Verschieben mehrerer Knoten ziehen Sie bei gehaltener linker
    Maustaste ein Auswahlfeld über die zu verschiebenden Stellen
    bzw. Transitionen. Die Knoten sind dann durch eine rote Umrahmung
    markiert. Ziehen sie nun einen beliebigen Knoten mit dem
    Mauszeiger bei gehaltener linker Maustaste, um alle ausgewählten
    Knoten zu verschieben.
