src/main/resources/manual.org
*** Löschen von Stellen und Transitionen
    Zum Löschen von Knoten ziehen Sie bei gehaltener linker Maustaste
    ein Auswahlfeld über die zu löschenden Stellen
    bzw. Transitionen. Die Knoten sind dann durch eine rote Umrahmung
    markiert. Wählen Sie über die Menüleiste oder das Kontextmenü
    \Rightarrow *Edit* \Rightarrow *Remove selected nodes* - die
    markierten Objekte werden ohne Nachfrage und unwiderruflich
    gelöscht.  

    Beim Löschen von Knoten werden automatisch auch die an den Knoten
    verankerten Kanten entfernt.

*** Erstellen von Kanten
    Um eine Kante zu erstellen klicken Sie mit der linken Maustaste
    zweimal hintereinander auf einen Knoten.  Es erscheint eine Kante,
    die Ihrem Mauszeiger folgt.  Eine Rotfärbung kennzeichnet, dass
    die Kante am Ort Ihres Mauszeigers nicht verankert werden kann,
    eine Grünfärbung, dass eine Verankerung möglich ist.

    Wenn Sie während des Erstellens einer ungültigen Kante mit der
    linken Maustaste klicken, wird die Kante verworfen.  Wenn sie auf
    einem gültigen Zielknoten zweimal hintereinander klicken, wird die
    Kante am Zielknoten verankert.

*** Löschen von Kanten
    An einem Knoten können alle eingehenden und alle ausgehenden
    Kanten gelöscht werden.  Eine Auswahl und Löschung einzelner
    Kanten ist nicht möglich.
    
    Um eingehende Kanten an einem Knoten zu entfernen, ziehen Sie bei
    gehaltener linker Maustaste ein Auswahlfeld über die Stellen
    bzw. Transitionen deren eingehende Kanten entfernt werden sollen.
    Die Knoten sind dann durch eine rote Umrahmung markiert.  Über die
    Menüleiste oder das Kontextmenü wählen sie \Rightarrow *Edit*
    \Rightarrow *Remove incoming edges*. Die eingehenden Kanten werden
    entfernt.

    Um ausgehende Kanten zu entfernen, verfahren sie wie oben und
    wählen stattdessen \Rightarrow *Edit* \Rightarrow *Remove outgoing
    edges*. Die ausgehenden Kanten werden entfernt.

** Markieren von Stellen

   Neu erstellte Stellen sind ohne Markierung, bzw. mit einer
   sogenannten Nullmarke versehen. Um einer Stelle eine Markierung
   zuzuweisen, klicken Sie mit der rechten Maustaste in eine Stelle.
   Ein kleines Textfeld erscheint in welches Sie eine Zahl eingeben
   können. Durch Bestätigen mit der \verb|Enter| oder \verb|Return|
   Taste wird der Stelle diese Markierung zugewiesen. Die Eingabe kann
   mit der \verb|ESC| Taste abgebrochen werden.  Eine ungültige
   Eingabe wird durch roten Text gekennzeichnet.

   Die Markierung einer Stelle wird entweder durch einen schwarzen
   Punkt oder eine Zahl \verb|>2| gekennzeichnet. Nullmarken werden
   nicht ausgezeichnet.

** Aktivierung von Transitionen

   Aktivierte, grün gefärbte Transitionen können geschaltet werden.
   Das Schalten erfolgt durch Klicken der rechten Maustaste auf der
   aktivierten Transition.  Transitionen können nur einzeln geschaltet
   werden.

** Beschriftung von Knoten 

   Um eine Stelle oder Transition zu beschriften, klicken Sie mit der
   rechten Maustaste in das Beschriftungfeld über einem Knoten. Es
   erscheint ein editierbares Textfeld in das Sie einen neuen Namen
   schreiben können. Durch Bestätigen mit der \verb|Enter| oder
   \verb|Return| Taste wird dem Knoten der neue Name zugewiesen. Die
   Eingabe kann mit der \verb|ESC| Taste abgebrochen werden.  Eine
   ungültige Eingabe wird durch roten Text gekennzeichnet.

   Die Beschriftungen können mit gehaltener linker Maustaste relativ
   zu ihren Knoten verschoben werden.

** Ändern der Größe von Knoten, Marken und Kanten

   Um die Größe der Knoten, Schriftgröße der Markierungen oder die
   Größe der Pfeilspitzen zu verändern, wählen Sie in der Menüleiste
   \Rightarrow *Preferences* \Rightarrow *Settings*. Sie können nun
   über die Eingabe im Textfeld oder Verschieben des Reglers die
   jeweilige Größe ändern.


* Bekannte Probleme

** OutOfMemoryException bei NodeRequests

   Requests - Ereignisse die eine Antwort erwarten und Asynchron
   gestartet werden, Überfluten den Threadpool.  Diese Problem tritt
   bereits bei relativ kleinen Netzen auf, da die voreingestellte
   Lebensdauer abgehandelter Threads recht hoch ist.  Pro Listener
   Aufruf wird ein neuer Thread gestartet, der weiterlebt nachdem der
   Aufruf (erfolglos) endet. Das Problem ist lösbar, indem ein eigener
   Threadpool implementiert wird, welcher Threads wiederverwendet, und
   beendete Threads aufräumt. Die Stelle im Code:
   \verb|de.markusrother.pned.gui.control.PnEventBus.requestNode(NodeRequest)|
   

    
